In [1]:
# import pandas and Numpy

import pandas as pd
import numpy as np

## DataFrames are created  by python Lists and dictionaries
### Row Oriented 
### Column Oriented

## Row Oriented

In [8]:
#For Dictionaries
sales = [{'account': 'Jones LLC', 'Jan': 150, 'Feb': 200, 'Mar': 140}, {'account': 'Alpha Co', 'Jan': 200, 'Feb': 210, 'Mar': 215}, {'account': 'Blue Inc', 'Jan': 50, 'Feb': 90, 'Mar': 95 }]
df_dict =pd.DataFrame(sales)

In [9]:
df_dict.head()

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [10]:
# For list


sales = [ (' Jones LLC' , 150, 200, 50), (' Al pha Co' , 200, 210, 90), ('Blue Inc', 140, 215, 95)]
labels = ['account', 'Jan', 'Feb', 'Mar']
df_list = pd.DataFrame.from_records( sales, columns=labels)

In [11]:
df_list.head()

      account  Jan  Feb  Mar
0   Jones LLC  150  200   50
1   Al pha Co  200  210   90
2    Blue Inc  140  215   95

## Column Oriented

In [14]:
# For dictionary

sales = {'account': ['Jones LLC', 'Alpha Co', 'Blue Inc'],
          'Jan' :[150,200,20],
          'Feb' :[200,210,90],
          'Mar':[140,215,95] }
df2_dict = pd.DataFrame.from_dict(sales)

In [15]:
df2_dict.head()

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   20   90   95

In [19]:
# For list

sales = [('account', ['Jones LLC', 'Alpha Co', 'Blue Inc']),
          ('Jan',[150,200,20]),
          ('Feb' ,[200,210,90]),
          ('Mar',[140,215,95])]
df2_list = pd.DataFrame.from_items(sales)

/Users/mukeshchaudhary/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  import sys

In [20]:
df2_list.head()

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   20   90   95

In [21]:
df_dict.describe()

              Jan         Feb         Mar
count    3.000000    3.000000    3.000000
mean   133.333333  166.666667  150.000000
std     76.376262   66.583281   60.621778
min     50.000000   90.000000   95.000000
25%    100.000000  145.000000  117.500000
50%    150.000000  200.000000  140.000000
75%    175.000000  205.000000  177.500000
max    200.000000  210.000000  215.000000

In [22]:
df_dict.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
account    3 non-null object
Jan        3 non-null int64
Feb        3 non-null int64
Mar        3 non-null int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [23]:
df_list.head()

      account  Jan  Feb  Mar
0   Jones LLC  150  200   50
1   Al pha Co  200  210   90
2    Blue Inc  140  215   95

In [24]:
df_dict['account']

0    Jones LLC
1     Alpha Co
2     Blue Inc
Name: account, dtype: object

In [25]:
type(df_dict['account'])

pandas.core.series.Series

In [26]:
df_dict[['account','Jan']]

     account  Jan
0  Jones LLC  150
1   Alpha Co  200
2   Blue Inc   50